---
title: LineLightShape
classe: Autodesk.Revit.DB.Lighting.LineLightShape
namespace: Autodesk.Revit.DB.Lighting
eredita: Autodesk.Revit.DB.Lighting.LightShape
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 1
---

# LineLightShape

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double EmitLength { get; set; }` | `lineLightShape.EmitLength` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```